app/controllers/employes_controller.rb

SELECT "employes".* FROM "employes"
---
	def index
	  @employe = Employe.all

SELECT  "employes".* FROM "employes"  WHERE "employes"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      @employe = Employe.find(params[:id])

INSERT INTO "employes" ("created_at", "employe_adress", "employe_background_info", "employe_deparment", "employe_dob", "employe_email_address", "employe_end_date", "employe_gender", "employe_join_date", "employe_name", "employe_vehicle_no", "employe_work_expriance", "employe_work_role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      @employe = Employe.new(employe_params)
      respond_to do |format|
      	if @employe.save

SELECT  "employes".* FROM "employes"  WHERE "employes"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
      @employe = Employe.find(params[:id])