app/controllers/locations_controller.rb

  def index
    # if user enter location search near location w.r.t user location
    if params[:address].present?
      @locations = Location.near(params[:address], params[:distance], :units => :km)
      @hash = Gmaps4rails.build_markers(@locations) do |location, marker|
        marker.lat location.latitude
        marker.lng location.longitude
        marker.infowindow render_to_string(:partial => "infowindow", :locals => { :object => location})
        marker.json({ :address => location.address.split(',').first })
      end
      respond_to do |format|
        format.html # show.html.erb
        format.js
      end
    else
      # intially the
      @locations = Location.all
---
SELECT locations.*, (111.19492664455873 * ABS(locations.latitude - 18.5204303) * 0.7071067811865475) + (96.29763124613503 * ABS(locations.longitude - 73.8567437) * 0.7071067811865475) AS distance, CASE WHEN (locations.latitude >= 18.5204303 AND locations.longitude >= 73.8567437) THEN  45.0 WHEN (locations.latitude <  18.5204303 AND locations.longitude >= 73.8567437) THEN 135.0 WHEN (locations.latitude <  18.5204303 AND locations.longitude <  73.8567437) THEN 225.0 WHEN (locations.latitude >= 18.5204303 AND locations.longitude <  73.8567437) THEN 315.0 END AS bearing FROM "locations"  WHERE (locations.latitude BETWEEN 18.070769497040637 AND 18.970091102959366 AND locations.longitude BETWEEN 73.38252323327167 AND 74.33096416672832)  ORDER BY distance ASC

  def show
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "description", "user_id", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(location_params)
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "locations" SET "description" = ?, "updated_at" = ? WHERE "locations"."id" = 1  [["description", "Near Pune  Airport"], ["updated_at", "2015-04-20 10:53:52.888097"]]

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 1]]